#---------------------------------------------------------
# SET LIBRARY PATH
#---------------------------------------------------------

set_db init_lib_search_path /cadence/install/FOUNDRY-01/digital/90nm/dig/lib

#---------------------------------------------------------
# READ LIBRARY + RTL
#---------------------------------------------------------

read_libs slow.lib

read_hdl alu_system.v

elaborate alu_system

#---------------------------------------------------------
# CONSTRAINTS
#---------------------------------------------------------

read_sdc ./constraints.sdc

#---------------------------------------------------------
# SYNTHESIS
#---------------------------------------------------------
syn_gen
syn_map

syn_opt

#---------------------------------------------------------
# POWER REPORT
#---------------------------------------------------------

report_power > power.rpt

#---------------------------------------------------------
# REPORTS
#---------------------------------------------------------

report_area   > area.rpt

report_timing > timing.rpt

report_power  > power.rpt

report_qor    > qor.rpt

#---------------------------------------------------------
# OUTPUT NETLIST
#---------------------------------------------------------

write_hdl > alu_system_netlist.v
